문제 1

In [2]:
import pandas as pd

profit1 = {'매출': [1000, 1500, 3000, 4000, 5000, 6000],
          '비용': [1500, 2000, 2500, 2700, 3000, 3200]}

columns1 = ['매출', '비용']
index1 = ['1월', '2월', '3월', '4월', '5월', '6월']
df1 = pd.DataFrame(profit1, index = index1, columns = columns1)
df1['이익'] = df1['매출'] - df1['비용']
df1

      매출    비용    이익
1월  1000  1500  -500
2월  1500  2000  -500
3월  3000  2500   500
4월  4000  2700  1300
5월  5000  3000  2000
6월  6000  3200  2800

In [3]:
profit2 = {'매출' : [4500, 4000, 5000, 6000, 3000, 2000],
 '비용' : [2800, 2700, 3000, 3200, 2500, 2000]}
columns2 = ['매출', '비용']
index2 = ['7월', '8월', '9월', '10월', '11월', '12월']
df2 = pd.DataFrame(profit2, index=index2, columns=columns2)
df2['이익'] = df2['매출'] - df2['비용']
df2

       매출    비용    이익
7월   4500  2800  1700
8월   4000  2700  1300
9월   5000  3000  2000
10월  6000  3200  2800
11월  3000  2500   500
12월  2000  2000     0

In [5]:
df1 = pd.DataFrame(df1)
df2 = pd.DataFrame(df2)

In [10]:
df12 = pd.concat([df1, df2])
df12

       매출    비용    이익
1월   1000  1500  -500
2월   1500  2000  -500
3월   3000  2500   500
4월   4000  2700  1300
5월   5000  3000  2000
6월   6000  3200  2800
7월   4500  2800  1700
8월   4000  2700  1300
9월   5000  3000  2000
10월  6000  3200  2800
11월  3000  2500   500
12월  2000  2000     0

문제 2

In [14]:
df12.info()

<class 'pandas.core.frame.DataFrame'>
Index: 12 entries, 1월 to 12월
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   매출      12 non-null     int64
 1   비용      12 non-null     int64
 2   이익      12 non-null     int64
 3   총실적     0 non-null      float64
dtypes: float64(1), int64(3)
memory usage: 480.0+ bytes

In [16]:
df12[['매출', '비용', '이익']].sum(axis=1)

1월      2000
2월      3000
3월      6000
4월      8000
5월     10000
6월     12000
7월      9000
8월      8000
9월     10000
10월    12000
11월     6000
12월     4000
dtype: int64

In [17]:
df12['총실적'] = df12[['매출', '비용', '이익']].sum(axis=1)
df12

       매출    비용    이익    총실적
1월   1000  1500  -500   2000
2월   1500  2000  -500   3000
3월   3000  2500   500   6000
4월   4000  2700  1300   8000
5월   5000  3000  2000  10000
6월   6000  3200  2800  12000
7월   4500  2800  1700   9000
8월   4000  2700  1300   8000
9월   5000  3000  2000  10000
10월  6000  3200  2800  12000
11월  3000  2500   500   6000
12월  2000  2000     0   4000

---

문제 3

In [18]:
df = pd.DataFrame({"A": [10, 14, 18], "B": [11,15,19], "C": [12,16,20], "D": [13,17,21]})
df

    A   B   C   D
0  10  11  12  13
1  14  15  16  17
2  18  19  20  21

In [20]:
df.index = ['a', 'b', 'c']
df

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  18  19  20  21

문제 4

In [25]:
df.iloc[1:3,:]

    A   B   C   D
b  14  15  16  17
c  18  19  20  21

In [ ]:
df['b':'c']

문제 5

In [27]:
df.loc["b":, "A"]

b    14
c    18
Name: A, dtype: int64

문제 6

In [28]:
df.loc[df.A > 10, :]

    A   B   C   D
b  14  15  16  17
c  18  19  20  21

문제 7

In [30]:
df1 = pd.DataFrame({"A": [10, 14, 18, 90], "B": [11,15,19,91], "C": [12,16,20,92], "D": [13,17,21,93]})
df1

df1.index = ['a', 'b', 'c', 'e']
df1

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  18  19  20  21
e  90  91  92  93

In [31]:
df1.iloc[0, -2:]

C    12
D    13
Name: a, dtype: int64

문제 8

In [33]:
import numpy as np
d = np.arange(10)
d = pd.Series(d)
d

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
dtype: int32

In [37]:
d[[1,3]] = np.NaN
d

0    0.0
1    NaN
2    2.0
3    NaN
4    4.0
5    5.0
6    6.0
7    7.0
8    8.0
9    9.0
dtype: float64

----

In [ ]:
d = pd.Series(range(10))
s[0] = np.nan
s[2] = np.nan

문제 9

In [38]:
df2 = pd.DataFrame({"0": [0.0, 3.0, 3.0, 4.0], "1": [0.0, 0.0, 2.0, 3.0], "2": [3.0, 2.0, 1.0, 4.0], "3": [2.0, 1.0, np.NaN, 2.0]})
df2

     0    1    2    3
0  0.0  0.0  3.0  2.0
1  3.0  0.0  2.0  1.0
2  3.0  2.0  1.0  NaN
3  4.0  3.0  4.0  2.0

In [39]:
df2.sort_values(by = '2', ascending = True)

     0    1    2    3
2  3.0  2.0  1.0  NaN
1  3.0  0.0  2.0  1.0
0  0.0  0.0  3.0  2.0
3  4.0  3.0  4.0  2.0

---

In [ ]:
df2.sort_values(by=2)

문제 10

In [48]:
df2.loc[:,'3']

0    2.0
1    1.0
2    NaN
3    2.0
Name: 3, dtype: float64

In [49]:
df2.fillna(df2.loc[:,'3'].mean())

     0    1    2         3
0  0.0  0.0  3.0  2.000000
1  3.0  0.0  2.0  1.000000
2  3.0  2.0  1.0  1.666667
3  4.0  3.0  4.0  2.000000

---